### First, a simple transform

In [6]:
import pandas as pd
import numpy as np

In [7]:
np.random.seed(124)
df = pd.DataFrame({
    'group':np.random.choice(['a', 'b'], 5),
    'x':np.random.randint(100, 200, 5)
}).sort_values(by='group')

df['g_sum'] = (
    df
        .groupby('group')['x']
        .transform(np.sum)
)
df

  group    x  g_sum
0     a  141    483
1     a  164    483
4     a  178    483
2     b  120    248
3     b  128    248

Notice that `.transform` returned a result that is the same size as the original dataframe.

### We can also use `.transform()` with a user defined function

In [8]:
def max_minus_one(col):
    """ Get the max - 1 of a list"""
    return np.max(col) - 1

df['udf'] = (
    df
        .groupby('group')['x']
        .transform(max_minus_one)
)
df

  group    x  g_sum  udf
0     a  141    483  177
1     a  164    483  177
4     a  178    483  177
2     b  120    248  127
3     b  128    248  127

### Lambda functions can also be used

We can write the above task in a single line using a lambda function.

In [9]:
df['use_lam'] = (
    df
    .groupby('group')['x']
    .transform(lambda x: np.max(x) - 1)
)
df

  group    x  g_sum  udf  use_lam
0     a  141    483  177      177
1     a  164    483  177      177
4     a  178    483  177      177
2     b  120    248  127      127
3     b  128    248  127      127